In [4]:
import pandas as pd

### Criando data

In [3]:
data = [[1,2,3], [4,5,6], [7,8,9]]
data

[[1, 2, 3], [4, 5, 6], [7, 8, 9]]

### Criando uma lista atraves de caracteres

In [7]:
list("XYZ")

['X', 'Y', 'Z']

### Criando um dataSet, passando list como index e coluna

In [13]:
df = pd.DataFrame(data, list('321'), list('ZYX'))
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9

### Ordenando indices

In [14]:
df.sort_index(inplace=True)
df

   Z  Y  X
1  7  8  9
2  4  5  6
3  1  2  3

### Ordenando Colunas

In [16]:
df.sort_index(inplace=True, axis = 1)
df

   X  Y  Z
1  9  8  7
2  6  5  4
3  3  2  1

### Ordenando dataSet pelos valores da coluna X

In [18]:
df.sort_values(by = 'X', inplace=True)
df

   X  Y  Z
3  3  2  1
2  6  5  4
1  9  8  7

### Ordenando dataSet pelos valores da linha 3

In [19]:
df.sort_values(by = '3', axis = 1, inplace=True)
df

   Z  Y  X
3  1  2  3
2  4  5  6
1  7  8  9